#ifndef RESMETRICS_HPP
#define RESMETRICS_HPP

/* С формальной точки зрения этот хардкод должен 
 * обеспечить отображения вьюпортов без артефактов. 
 * "Поддерживаемые разрешения", бишь.
 */

const int resolution_metrics[][7] = {
// 	scrW,	scrH,	resW, 	resH, 	oriX, 	oriY, 	gfW, 	gfH,	brdr
{	640,	480,	32,		16,		384,	448,	0 	}, 	// 4:3
{	800,	600, 	40,		20,		480,	560,	0 	},
{	1024,	768, 	51,		25,		615, 	717,	0 	},
{	1152,	864,	58,		29,		692,	807,	0 	},
{	1280,	960, 	64,		32,		768,	896,	0 	},
{	1600,	1200,	80,		40,		960,	1120,	0 	},
{	640,	480,	32,		16,		384,	448,	107	},	// 16:9
{	960,	720,	48,		24,		576,	672,	160	},
{	1200,	900,	60,		30,		720,	840,	200	},
{	1440,	1080,	72,		36,		864,	1008,	240 },
{	640,	480,	32,		16,		384,	448,	64	},	// 16:10
{	1200,	900,	60,		30,		720,	840,	110	},
{	1400,	1050,	70,		35,		840,	980,	140	},
{	1600,	1200,	80,		40,		960,	1120,	160	}
	// Прочие

 };


#endif
